Auth.js updated
